eNum_1_0_1_1/InformationRegisters/ун30_ТекущиеНомераДокументов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ун30_ТекущиеНомераДокументов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Номер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>21</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПорядковыйНомер</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Счетчик</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ИмяДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

eNum_1_0_1_1/CommonModules/ун30_Сервер/Ext/Module.bsl
Функция ПолучитьНастройкиФорматаДаты(ФорматДатыстрокой="") Экспорт
	
	Результат = Новый Структура;
	
	Массив = СтрРазделить(ФорматДатыстрокой, "~");
	Если Массив[0]= "10&01&21" Тогда
		ФорматДаты = 1;
	ИначеЕсли Массив[0] = "10&01" Тогда
		ФорматДаты = 2;
	КонецЕсли;
	РазделительДаты = Массив[1];
	Результат.Вставить("ФорматДаты", ФорматДаты);
	Результат.Вставить("Разделитель", РазделительДаты);
	
	Возврат Результат;
	
КонецФункции

Функция СформироватьПримерНомераПоДате(Данные, БазовыеНастройки, Тест=0) Экспорт
	
	Результат = "";
	
	Если Данные.ФорматДаты = 1 Тогда
		фСтрока = СтрШаблон("ДФ=дд%1ММ%1гг", Данные.Разделитель);
		Префикс = Формат(БазовыеНастройки.ДатаИсточника, фСтрока);
	ИначеЕсли Данные.ФорматДаты = 2 Тогда
		фСтрока = СтрШаблон("ДФ=ММ%1гг", Данные.Разделитель);
		Префикс = Формат(БазовыеНастройки.ДатаИсточника, фСтрока);
	ИначеЕсли Данные.ФорматДаты = 3 Тогда
		фСтрока = СтрШаблон("ДФ=дд%1ММ", Данные.Разделитель);
		Префикс = Формат(БазовыеНастройки.ДатаИсточника, фСтрока);
	Иначе 
		Сообщить("Неверный формат даты");
		Сообщить("Пример не сформирован. Попробуйте повторно сохранить настройки");
		Возврат Результат;
	КонецЕсли;
	
	Если Тест Тогда
		Номер = Данные.ПроизвольныйНомер;
	Иначе 
		Номер = РегистрыСведений.ун30_ТекущиеНомераДокументов.ПоследнийНомерДокумента(БазовыеНастройки).ПоследнийНомер + 1;
	КонецЕсли;
	НомерСтрокой = Формат(Номер, "ЧГ=0");
	
	мд = Метаданные.Документы.Найти(БазовыеНастройки.ИмяДокумента);
	
	КонтрольДлины = мд.ДлинаНомера - СтрДлина(Префикс)-СтрДлина(НомерСтрокой) - 1; // - 1 разделитель
	Если КонтрольДлины < 0 Тогда
		Результат = "Ошибка_ДлинаНомера";
		Возврат Результат;
	КонецЕсли;
	
	Нули = Лев("00000000000000000000", КонтрольДлины);
	
	Результат = СтрШаблон("%1%2%3%4", Префикс, БазовыеНастройки.Разделитель, Нули, НомерСтрокой);
	
	Возврат Результат;
	
КонецФункции

Функция СформироватьПримерНомераПоРеквизиту(Настройки, БазовыеНастройки) Экспорт
КонецФункции
